name: "PyramidNet-101"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 224
input_dim: 224

layer {
   name: "conv1"
   type: "Convolution"
   bottom: "data"
   top: "conv1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 64
      bias_term: false
      pad: 3
      kernel_size: 7
      stride: 2
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1"
   type: "BatchNorm"
   bottom: "conv1"
   top: "conv1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1"
   type: "Scale"
   bottom: "conv1"
   top: "conv1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1"
   type: "ReLU"
   bottom: "conv1"
   top: "conv1"
}

layer {
   name: "max1"
   type: "Pooling"
   bottom: "conv1"
   top: "max1"
   pooling_param {
      pool: MAX
      kernel_size: 3
      stride: 2
      pad: 1
   }
}

layer {
   name: "bn1_1"
   type: "BatchNorm"
   bottom: "max1"
   top: "bn1_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1"
   type: "Scale"
   bottom: "bn1_1"
   top: "bn1_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv1_1_1"
   type: "Convolution"
   bottom: "bn1_1"
   top: "conv1_1_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 72
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_1_1"
   type: "BatchNorm"
   bottom: "conv1_1_1"
   top: "conv1_1_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1_1"
   type: "Scale"
   bottom: "conv1_1_1"
   top: "conv1_1_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_1_1"
   type: "ReLU"
   bottom: "conv1_1_1"
   top: "conv1_1_1"
}

layer {
   name: "conv1_1_2"
   type: "Convolution"
   bottom: "conv1_1_1"
   top: "conv1_1_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 72
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_1_2"
   type: "BatchNorm"
   bottom: "conv1_1_2"
   top: "conv1_1_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1_2"
   type: "Scale"
   bottom: "conv1_1_2"
   top: "conv1_1_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_1_2"
   type: "ReLU"
   bottom: "conv1_1_2"
   top: "conv1_1_2"
}

layer {
   name: "conv1_1_3"
   type: "Convolution"
   bottom: "conv1_1_2"
   top: "conv1_1_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 288
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_1_3"
   type: "BatchNorm"
   bottom: "conv1_1_3"
   top: "conv1_1_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1_3"
   type: "Scale"
   bottom: "conv1_1_3"
   top: "conv1_1_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv1_1"
   type: "Convolution"
   bottom: "max1"
   top: "zero_conv1_1"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 224
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero1_1"
   type: "Concat"
   bottom: "max1"
   bottom: "zero_conv1_1"
   top: "zero1_1"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res1_1"
   type: "Eltwise"
   bottom: "zero1_1"
   bottom: "conv1_1_3"
   top: "res1_1"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn1_2"
   type: "BatchNorm"
   bottom: "res1_1"
   top: "bn1_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2"
   type: "Scale"
   bottom: "bn1_2"
   top: "bn1_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv1_2_1"
   type: "Convolution"
   bottom: "bn1_2"
   top: "conv1_2_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 79
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_2_1"
   type: "BatchNorm"
   bottom: "conv1_2_1"
   top: "conv1_2_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2_1"
   type: "Scale"
   bottom: "conv1_2_1"
   top: "conv1_2_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_2_1"
   type: "ReLU"
   bottom: "conv1_2_1"
   top: "conv1_2_1"
}

layer {
   name: "conv1_2_2"
   type: "Convolution"
   bottom: "conv1_2_1"
   top: "conv1_2_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 79
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_2_2"
   type: "BatchNorm"
   bottom: "conv1_2_2"
   top: "conv1_2_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2_2"
   type: "Scale"
   bottom: "conv1_2_2"
   top: "conv1_2_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_2_2"
   type: "ReLU"
   bottom: "conv1_2_2"
   top: "conv1_2_2"
}

layer {
   name: "conv1_2_3"
   type: "Convolution"
   bottom: "conv1_2_2"
   top: "conv1_2_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 316
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_2_3"
   type: "BatchNorm"
   bottom: "conv1_2_3"
   top: "conv1_2_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2_3"
   type: "Scale"
   bottom: "conv1_2_3"
   top: "conv1_2_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv1_2"
   type: "Convolution"
   bottom: "res1_1"
   top: "zero_conv1_2"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 28
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero1_2"
   type: "Concat"
   bottom: "res1_1"
   bottom: "zero_conv1_2"
   top: "zero1_2"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res1_2"
   type: "Eltwise"
   bottom: "zero1_2"
   bottom: "conv1_2_3"
   top: "res1_2"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn1_3"
   type: "BatchNorm"
   bottom: "res1_2"
   top: "bn1_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3"
   type: "Scale"
   bottom: "bn1_3"
   top: "bn1_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv1_3_1"
   type: "Convolution"
   bottom: "bn1_3"
   top: "conv1_3_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 87
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_3_1"
   type: "BatchNorm"
   bottom: "conv1_3_1"
   top: "conv1_3_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3_1"
   type: "Scale"
   bottom: "conv1_3_1"
   top: "conv1_3_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_3_1"
   type: "ReLU"
   bottom: "conv1_3_1"
   top: "conv1_3_1"
}

layer {
   name: "conv1_3_2"
   type: "Convolution"
   bottom: "conv1_3_1"
   top: "conv1_3_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 87
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_3_2"
   type: "BatchNorm"
   bottom: "conv1_3_2"
   top: "conv1_3_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3_2"
   type: "Scale"
   bottom: "conv1_3_2"
   top: "conv1_3_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_3_2"
   type: "ReLU"
   bottom: "conv1_3_2"
   top: "conv1_3_2"
}

layer {
   name: "conv1_3_3"
   type: "Convolution"
   bottom: "conv1_3_2"
   top: "conv1_3_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 348
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_3_3"
   type: "BatchNorm"
   bottom: "conv1_3_3"
   top: "conv1_3_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3_3"
   type: "Scale"
   bottom: "conv1_3_3"
   top: "conv1_3_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv1_3"
   type: "Convolution"
   bottom: "res1_2"
   top: "zero_conv1_3"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 32
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero1_3"
   type: "Concat"
   bottom: "res1_2"
   bottom: "zero_conv1_3"
   top: "zero1_3"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res1_3"
   type: "Eltwise"
   bottom: "zero1_3"
   bottom: "conv1_3_3"
   top: "res1_3"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_1"
   type: "BatchNorm"
   bottom: "res1_3"
   top: "bn2_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1"
   type: "Scale"
   bottom: "bn2_1"
   top: "bn2_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_1_1"
   type: "Convolution"
   bottom: "bn2_1"
   top: "conv2_1_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 94
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_1_1"
   type: "BatchNorm"
   bottom: "conv2_1_1"
   top: "conv2_1_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1_1"
   type: "Scale"
   bottom: "conv2_1_1"
   top: "conv2_1_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_1_1"
   type: "ReLU"
   bottom: "conv2_1_1"
   top: "conv2_1_1"
}

layer {
   name: "conv2_1_2"
   type: "Convolution"
   bottom: "conv2_1_1"
   top: "conv2_1_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 94
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 2
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_1_2"
   type: "BatchNorm"
   bottom: "conv2_1_2"
   top: "conv2_1_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1_2"
   type: "Scale"
   bottom: "conv2_1_2"
   top: "conv2_1_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_1_2"
   type: "ReLU"
   bottom: "conv2_1_2"
   top: "conv2_1_2"
}

layer {
   name: "conv2_1_3"
   type: "Convolution"
   bottom: "conv2_1_2"
   top: "conv2_1_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 376
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_1_3"
   type: "BatchNorm"
   bottom: "conv2_1_3"
   top: "conv2_1_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1_3"
   type: "Scale"
   bottom: "conv2_1_3"
   top: "conv2_1_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "pool2"
   type: "Pooling"
   bottom: "res1_3"
   top: "pool2"
   pooling_param {
      pool: AVE
      kernel_size: 2
      stride: 2
   }}

layer {
   name: "zero_conv2_1"
   type: "Convolution"
   bottom: "pool2"
   top: "zero_conv2_1"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 28
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_1"
   type: "Concat"
   bottom: "pool2"
   bottom: "zero_conv2_1"
   top: "zero2_1"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_1"
   type: "Eltwise"
   bottom: "zero2_1"
   bottom: "conv2_1_3"
   top: "res2_1"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_2"
   type: "BatchNorm"
   bottom: "res2_1"
   top: "bn2_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2"
   type: "Scale"
   bottom: "bn2_2"
   top: "bn2_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_2_1"
   type: "Convolution"
   bottom: "bn2_2"
   top: "conv2_2_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 102
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_2_1"
   type: "BatchNorm"
   bottom: "conv2_2_1"
   top: "conv2_2_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2_1"
   type: "Scale"
   bottom: "conv2_2_1"
   top: "conv2_2_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_2_1"
   type: "ReLU"
   bottom: "conv2_2_1"
   top: "conv2_2_1"
}

layer {
   name: "conv2_2_2"
   type: "Convolution"
   bottom: "conv2_2_1"
   top: "conv2_2_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 102
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_2_2"
   type: "BatchNorm"
   bottom: "conv2_2_2"
   top: "conv2_2_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2_2"
   type: "Scale"
   bottom: "conv2_2_2"
   top: "conv2_2_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_2_2"
   type: "ReLU"
   bottom: "conv2_2_2"
   top: "conv2_2_2"
}

layer {
   name: "conv2_2_3"
   type: "Convolution"
   bottom: "conv2_2_2"
   top: "conv2_2_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 408
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_2_3"
   type: "BatchNorm"
   bottom: "conv2_2_3"
   top: "conv2_2_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2_3"
   type: "Scale"
   bottom: "conv2_2_3"
   top: "conv2_2_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_2"
   type: "Convolution"
   bottom: "res2_1"
   top: "zero_conv2_2"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 32
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_2"
   type: "Concat"
   bottom: "res2_1"
   bottom: "zero_conv2_2"
   top: "zero2_2"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_2"
   type: "Eltwise"
   bottom: "zero2_2"
   bottom: "conv2_2_3"
   top: "res2_2"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_3"
   type: "BatchNorm"
   bottom: "res2_2"
   top: "bn2_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3"
   type: "Scale"
   bottom: "bn2_3"
   top: "bn2_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_3_1"
   type: "Convolution"
   bottom: "bn2_3"
   top: "conv2_3_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 109
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_3_1"
   type: "BatchNorm"
   bottom: "conv2_3_1"
   top: "conv2_3_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3_1"
   type: "Scale"
   bottom: "conv2_3_1"
   top: "conv2_3_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_3_1"
   type: "ReLU"
   bottom: "conv2_3_1"
   top: "conv2_3_1"
}

layer {
   name: "conv2_3_2"
   type: "Convolution"
   bottom: "conv2_3_1"
   top: "conv2_3_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 109
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_3_2"
   type: "BatchNorm"
   bottom: "conv2_3_2"
   top: "conv2_3_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3_2"
   type: "Scale"
   bottom: "conv2_3_2"
   top: "conv2_3_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_3_2"
   type: "ReLU"
   bottom: "conv2_3_2"
   top: "conv2_3_2"
}

layer {
   name: "conv2_3_3"
   type: "Convolution"
   bottom: "conv2_3_2"
   top: "conv2_3_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 436
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_3_3"
   type: "BatchNorm"
   bottom: "conv2_3_3"
   top: "conv2_3_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3_3"
   type: "Scale"
   bottom: "conv2_3_3"
   top: "conv2_3_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_3"
   type: "Convolution"
   bottom: "res2_2"
   top: "zero_conv2_3"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 28
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_3"
   type: "Concat"
   bottom: "res2_2"
   bottom: "zero_conv2_3"
   top: "zero2_3"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_3"
   type: "Eltwise"
   bottom: "zero2_3"
   bottom: "conv2_3_3"
   top: "res2_3"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_4"
   type: "BatchNorm"
   bottom: "res2_3"
   top: "bn2_4"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4"
   type: "Scale"
   bottom: "bn2_4"
   top: "bn2_4"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_4_1"
   type: "Convolution"
   bottom: "bn2_4"
   top: "conv2_4_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 117
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_4_1"
   type: "BatchNorm"
   bottom: "conv2_4_1"
   top: "conv2_4_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4_1"
   type: "Scale"
   bottom: "conv2_4_1"
   top: "conv2_4_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_4_1"
   type: "ReLU"
   bottom: "conv2_4_1"
   top: "conv2_4_1"
}

layer {
   name: "conv2_4_2"
   type: "Convolution"
   bottom: "conv2_4_1"
   top: "conv2_4_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 117
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_4_2"
   type: "BatchNorm"
   bottom: "conv2_4_2"
   top: "conv2_4_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4_2"
   type: "Scale"
   bottom: "conv2_4_2"
   top: "conv2_4_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_4_2"
   type: "ReLU"
   bottom: "conv2_4_2"
   top: "conv2_4_2"
}

layer {
   name: "conv2_4_3"
   type: "Convolution"
   bottom: "conv2_4_2"
   top: "conv2_4_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 468
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_4_3"
   type: "BatchNorm"
   bottom: "conv2_4_3"
   top: "conv2_4_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4_3"
   type: "Scale"
   bottom: "conv2_4_3"
   top: "conv2_4_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_4"
   type: "Convolution"
   bottom: "res2_3"
   top: "zero_conv2_4"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 32
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_4"
   type: "Concat"
   bottom: "res2_3"
   bottom: "zero_conv2_4"
   top: "zero2_4"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_4"
   type: "Eltwise"
   bottom: "zero2_4"
   bottom: "conv2_4_3"
   top: "res2_4"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_1"
   type: "BatchNorm"
   bottom: "res2_4"
   top: "bn3_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_1"
   type: "Scale"
   bottom: "bn3_1"
   top: "bn3_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_1_1"
   type: "Convolution"
   bottom: "bn3_1"
   top: "conv3_1_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 125
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_1_1"
   type: "BatchNorm"
   bottom: "conv3_1_1"
   top: "conv3_1_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_1_1"
   type: "Scale"
   bottom: "conv3_1_1"
   top: "conv3_1_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_1_1"
   type: "ReLU"
   bottom: "conv3_1_1"
   top: "conv3_1_1"
}

layer {
   name: "conv3_1_2"
   type: "Convolution"
   bottom: "conv3_1_1"
   top: "conv3_1_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 125
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 2
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_1_2"
   type: "BatchNorm"
   bottom: "conv3_1_2"
   top: "conv3_1_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_1_2"
   type: "Scale"
   bottom: "conv3_1_2"
   top: "conv3_1_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_1_2"
   type: "ReLU"
   bottom: "conv3_1_2"
   top: "conv3_1_2"
}

layer {
   name: "conv3_1_3"
   type: "Convolution"
   bottom: "conv3_1_2"
   top: "conv3_1_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 500
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_1_3"
   type: "BatchNorm"
   bottom: "conv3_1_3"
   top: "conv3_1_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_1_3"
   type: "Scale"
   bottom: "conv3_1_3"
   top: "conv3_1_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "pool3"
   type: "Pooling"
   bottom: "res2_4"
   top: "pool3"
   pooling_param {
      pool: AVE
      kernel_size: 2
      stride: 2
   }}

layer {
   name: "zero_conv3_1"
   type: "Convolution"
   bottom: "pool3"
   top: "zero_conv3_1"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 32
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero3_1"
   type: "Concat"
   bottom: "pool3"
   bottom: "zero_conv3_1"
   top: "zero3_1"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res3_1"
   type: "Eltwise"
   bottom: "zero3_1"
   bottom: "conv3_1_3"
   top: "res3_1"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_2"
   type: "BatchNorm"
   bottom: "res3_1"
   top: "bn3_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_2"
   type: "Scale"
   bottom: "bn3_2"
   top: "bn3_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_2_1"
   type: "Convolution"
   bottom: "bn3_2"
   top: "conv3_2_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 132
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_2_1"
   type: "BatchNorm"
   bottom: "conv3_2_1"
   top: "conv3_2_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_2_1"
   type: "Scale"
   bottom: "conv3_2_1"
   top: "conv3_2_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_2_1"
   type: "ReLU"
   bottom: "conv3_2_1"
   top: "conv3_2_1"
}

layer {
   name: "conv3_2_2"
   type: "Convolution"
   bottom: "conv3_2_1"
   top: "conv3_2_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 132
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_2_2"
   type: "BatchNorm"
   bottom: "conv3_2_2"
   top: "conv3_2_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_2_2"
   type: "Scale"
   bottom: "conv3_2_2"
   top: "conv3_2_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_2_2"
   type: "ReLU"
   bottom: "conv3_2_2"
   top: "conv3_2_2"
}

layer {
   name: "conv3_2_3"
   type: "Convolution"
   bottom: "conv3_2_2"
   top: "conv3_2_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 528
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_2_3"
   type: "BatchNorm"
   bottom: "conv3_2_3"
   top: "conv3_2_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_2_3"
   type: "Scale"
   bottom: "conv3_2_3"
   top: "conv3_2_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv3_2"
   type: "Convolution"
   bottom: "res3_1"
   top: "zero_conv3_2"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 28
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero3_2"
   type: "Concat"
   bottom: "res3_1"
   bottom: "zero_conv3_2"
   top: "zero3_2"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res3_2"
   type: "Eltwise"
   bottom: "zero3_2"
   bottom: "conv3_2_3"
   top: "res3_2"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_3"
   type: "BatchNorm"
   bottom: "res3_2"
   top: "bn3_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_3"
   type: "Scale"
   bottom: "bn3_3"
   top: "bn3_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_3_1"
   type: "Convolution"
   bottom: "bn3_3"
   top: "conv3_3_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 140
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_3_1"
   type: "BatchNorm"
   bottom: "conv3_3_1"
   top: "conv3_3_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_3_1"
   type: "Scale"
   bottom: "conv3_3_1"
   top: "conv3_3_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_3_1"
   type: "ReLU"
   bottom: "conv3_3_1"
   top: "conv3_3_1"
}

layer {
   name: "conv3_3_2"
   type: "Convolution"
   bottom: "conv3_3_1"
   top: "conv3_3_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 140
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_3_2"
   type: "BatchNorm"
   bottom: "conv3_3_2"
   top: "conv3_3_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_3_2"
   type: "Scale"
   bottom: "conv3_3_2"
   top: "conv3_3_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_3_2"
   type: "ReLU"
   bottom: "conv3_3_2"
   top: "conv3_3_2"
}

layer {
   name: "conv3_3_3"
   type: "Convolution"
   bottom: "conv3_3_2"
   top: "conv3_3_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 560
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_3_3"
   type: "BatchNorm"
   bottom: "conv3_3_3"
   top: "conv3_3_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_3_3"
   type: "Scale"
   bottom: "conv3_3_3"
   top: "conv3_3_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv3_3"
   type: "Convolution"
   bottom: "res3_2"
   top: "zero_conv3_3"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 32
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero3_3"
   type: "Concat"
   bottom: "res3_2"
   bottom: "zero_conv3_3"
   top: "zero3_3"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res3_3"
   type: "Eltwise"
   bottom: "zero3_3"
   bottom: "conv3_3_3"
   top: "res3_3"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_4"
   type: "BatchNorm"
   bottom: "res3_3"
   top: "bn3_4"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_4"
   type: "Scale"
   bottom: "bn3_4"
   top: "bn3_4"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_4_1"
   type: "Convolution"
   bottom: "bn3_4"
   top: "conv3_4_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 147
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_4_1"
   type: "BatchNorm"
   bottom: "conv3_4_1"
   top: "conv3_4_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_4_1"
   type: "Scale"
   bottom: "conv3_4_1"
   top: "conv3_4_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_4_1"
   type: "ReLU"
   bottom: "conv3_4_1"
   top: "conv3_4_1"
}

layer {
   name: "conv3_4_2"
   type: "Convolution"
   bottom: "conv3_4_1"
   top: "conv3_4_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 147
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_4_2"
   type: "BatchNorm"
   bottom: "conv3_4_2"
   top: "conv3_4_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_4_2"
   type: "Scale"
   bottom: "conv3_4_2"
   top: "conv3_4_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_4_2"
   type: "ReLU"
   bottom: "conv3_4_2"
   top: "conv3_4_2"
}

layer {
   name: "conv3_4_3"
   type: "Convolution"
   bottom: "conv3_4_2"
   top: "conv3_4_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 588
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_4_3"
   type: "BatchNorm"
   bottom: "conv3_4_3"
   top: "conv3_4_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_4_3"
   type: "Scale"
   bottom: "conv3_4_3"
   top: "conv3_4_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv3_4"
   type: "Convolution"
   bottom: "res3_3"
   top: "zero_conv3_4"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 28
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero3_4"
   type: "Concat"
   bottom: "res3_3"
   bottom: "zero_conv3_4"
   top: "zero3_4"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res3_4"
   type: "Eltwise"
   bottom: "zero3_4"
   bottom: "conv3_4_3"
   top: "res3_4"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_5"
   type: "BatchNorm"
   bottom: "res3_4"
   top: "bn3_5"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_5"
   type: "Scale"
   bottom: "bn3_5"
   top: "bn3_5"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_5_1"
   type: "Convolution"
   bottom: "bn3_5"
   top: "conv3_5_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 155
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_5_1"
   type: "BatchNorm"
   bottom: "conv3_5_1"
   top: "conv3_5_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_5_1"
   type: "Scale"
   bottom: "conv3_5_1"
   top: "conv3_5_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_5_1"
   type: "ReLU"
   bottom: "conv3_5_1"
   top: "conv3_5_1"
}

layer {
   name: "conv3_5_2"
   type: "Convolution"
   bottom: "conv3_5_1"
   top: "conv3_5_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 155
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_5_2"
   type: "BatchNorm"
   bottom: "conv3_5_2"
   top: "conv3_5_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_5_2"
   type: "Scale"
   bottom: "conv3_5_2"
   top: "conv3_5_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_5_2"
   type: "ReLU"
   bottom: "conv3_5_2"
   top: "conv3_5_2"
}

layer {
   name: "conv3_5_3"
   type: "Convolution"
   bottom: "conv3_5_2"
   top: "conv3_5_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 620
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_5_3"
   type: "BatchNorm"
   bottom: "conv3_5_3"
   top: "conv3_5_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_5_3"
   type: "Scale"
   bottom: "conv3_5_3"
   top: "conv3_5_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv3_5"
   type: "Convolution"
   bottom: "res3_4"
   top: "zero_conv3_5"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 32
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero3_5"
   type: "Concat"
   bottom: "res3_4"
   bottom: "zero_conv3_5"
   top: "zero3_5"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res3_5"
   type: "Eltwise"
   bottom: "zero3_5"
   bottom: "conv3_5_3"
   top: "res3_5"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_6"
   type: "BatchNorm"
   bottom: "res3_5"
   top: "bn3_6"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_6"
   type: "Scale"
   bottom: "bn3_6"
   top: "bn3_6"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_6_1"
   type: "Convolution"
   bottom: "bn3_6"
   top: "conv3_6_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 162
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_6_1"
   type: "BatchNorm"
   bottom: "conv3_6_1"
   top: "conv3_6_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_6_1"
   type: "Scale"
   bottom: "conv3_6_1"
   top: "conv3_6_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_6_1"
   type: "ReLU"
   bottom: "conv3_6_1"
   top: "conv3_6_1"
}

layer {
   name: "conv3_6_2"
   type: "Convolution"
   bottom: "conv3_6_1"
   top: "conv3_6_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 162
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_6_2"
   type: "BatchNorm"
   bottom: "conv3_6_2"
   top: "conv3_6_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_6_2"
   type: "Scale"
   bottom: "conv3_6_2"
   top: "conv3_6_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_6_2"
   type: "ReLU"
   bottom: "conv3_6_2"
   top: "conv3_6_2"
}

layer {
   name: "conv3_6_3"
   type: "Convolution"
   bottom: "conv3_6_2"
   top: "conv3_6_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 648
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_6_3"
   type: "BatchNorm"
   bottom: "conv3_6_3"
   top: "conv3_6_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_6_3"
   type: "Scale"
   bottom: "conv3_6_3"
   top: "conv3_6_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv3_6"
   type: "Convolution"
   bottom: "res3_5"
   top: "zero_conv3_6"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 28
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero3_6"
   type: "Concat"
   bottom: "res3_5"
   bottom: "zero_conv3_6"
   top: "zero3_6"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res3_6"
   type: "Eltwise"
   bottom: "zero3_6"
   bottom: "conv3_6_3"
   top: "res3_6"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_7"
   type: "BatchNorm"
   bottom: "res3_6"
   top: "bn3_7"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_7"
   type: "Scale"
   bottom: "bn3_7"
   top: "bn3_7"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_7_1"
   type: "Convolution"
   bottom: "bn3_7"
   top: "conv3_7_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 170
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_7_1"
   type: "BatchNorm"
   bottom: "conv3_7_1"
   top: "conv3_7_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_7_1"
   type: "Scale"
   bottom: "conv3_7_1"
   top: "conv3_7_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_7_1"
   type: "ReLU"
   bottom: "conv3_7_1"
   top: "conv3_7_1"
}

layer {
   name: "conv3_7_2"
   type: "Convolution"
   bottom: "conv3_7_1"
   top: "conv3_7_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 170
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_7_2"
   type: "BatchNorm"
   bottom: "conv3_7_2"
   top: "conv3_7_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_7_2"
   type: "Scale"
   bottom: "conv3_7_2"
   top: "conv3_7_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_7_2"
   type: "ReLU"
   bottom: "conv3_7_2"
   top: "conv3_7_2"
}

layer {
   name: "conv3_7_3"
   type: "Convolution"
   bottom: "conv3_7_2"
   top: "conv3_7_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 680
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_7_3"
   type: "BatchNorm"
   bottom: "conv3_7_3"
   top: "conv3_7_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_7_3"
   type: "Scale"
   bottom: "conv3_7_3"
   top: "conv3_7_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv3_7"
   type: "Convolution"
   bottom: "res3_6"
   top: "zero_conv3_7"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 32
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero3_7"
   type: "Concat"
   bottom: "res3_6"
   bottom: "zero_conv3_7"
   top: "zero3_7"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res3_7"
   type: "Eltwise"
   bottom: "zero3_7"
   bottom: "conv3_7_3"
   top: "res3_7"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn3_8"
   type: "BatchNorm"
   bottom: "res3_7"
   top: "bn3_8"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_8"
   type: "Scale"
   bottom: "bn3_8"
   top: "bn3_8"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv3_8_1"
   type: "Convolution"
   bottom: "bn3_8"
   top: "conv3_8_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 178
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_8_1"
   type: "BatchNorm"
   bottom: "conv3_8_1"
   top: "conv3_8_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_8_1"
   type: "Scale"
   bottom: "conv3_8_1"
   top: "conv3_8_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_8_1"
   type: "ReLU"
   bottom: "conv3_8_1"
   top: "conv3_8_1"
}

layer {
   name: "conv3_8_2"
   type: "Convolution"
   bottom: "conv3_8_1"
   top: "conv3_8_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 178
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn3_8_2"
   type: "BatchNorm"
   bottom: "conv3_8_2"
   top: "conv3_8_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale3_8_2"
   type: "Scale"
   bottom: "conv3_8_2"
   top: "conv3_8_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu3_8_2"
   type: "ReLU"
   bottom: "conv3_8_2"
