name: "PyramidNet-200"

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_value: 104
    mean_value: 117
    mean_value: 124
    scale: 0.017352
    mirror: false
    crop_size: 224
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 5
    backend: LMDB
  }
}


layer {
   name: "conv1"
   type: "Convolution"
   bottom: "data"
   top: "conv1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 64
      bias_term: false
      pad: 3
      kernel_size: 7
      stride: 2
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1"
   type: "BatchNorm"
   bottom: "conv1"
   top: "conv1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1"
   type: "Scale"
   bottom: "conv1"
   top: "conv1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1"
   type: "ReLU"
   bottom: "conv1"
   top: "conv1"
}

layer {
   name: "max1"
   type: "Pooling"
   bottom: "conv1"
   top: "max1"
   pooling_param {
      pool: MAX
      kernel_size: 3
      stride: 2
      pad: 1
   }
}

layer {
   name: "bn1_1"
   type: "BatchNorm"
   bottom: "max1"
   top: "bn1_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1"
   type: "Scale"
   bottom: "bn1_1"
   top: "bn1_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv1_1_1"
   type: "Convolution"
   bottom: "bn1_1"
   top: "conv1_1_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 69
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_1_1"
   type: "BatchNorm"
   bottom: "conv1_1_1"
   top: "conv1_1_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1_1"
   type: "Scale"
   bottom: "conv1_1_1"
   top: "conv1_1_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_1_1"
   type: "ReLU"
   bottom: "conv1_1_1"
   top: "conv1_1_1"
}

layer {
   name: "conv1_1_2"
   type: "Convolution"
   bottom: "conv1_1_1"
   top: "conv1_1_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 69
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_1_2"
   type: "BatchNorm"
   bottom: "conv1_1_2"
   top: "conv1_1_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1_2"
   type: "Scale"
   bottom: "conv1_1_2"
   top: "conv1_1_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_1_2"
   type: "ReLU"
   bottom: "conv1_1_2"
   top: "conv1_1_2"
}

layer {
   name: "conv1_1_3"
   type: "Convolution"
   bottom: "conv1_1_2"
   top: "conv1_1_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 276
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_1_3"
   type: "BatchNorm"
   bottom: "conv1_1_3"
   top: "conv1_1_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_1_3"
   type: "Scale"
   bottom: "conv1_1_3"
   top: "conv1_1_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv1_1"
   type: "Convolution"
   bottom: "max1"
   top: "zero_conv1_1"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 212
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero1_1"
   type: "Concat"
   bottom: "max1"
   bottom: "zero_conv1_1"
   top: "zero1_1"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res1_1"
   type: "Eltwise"
   bottom: "zero1_1"
   bottom: "conv1_1_3"
   top: "res1_1"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn1_2"
   type: "BatchNorm"
   bottom: "res1_1"
   top: "bn1_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2"
   type: "Scale"
   bottom: "bn1_2"
   top: "bn1_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv1_2_1"
   type: "Convolution"
   bottom: "bn1_2"
   top: "conv1_2_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 73
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_2_1"
   type: "BatchNorm"
   bottom: "conv1_2_1"
   top: "conv1_2_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2_1"
   type: "Scale"
   bottom: "conv1_2_1"
   top: "conv1_2_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_2_1"
   type: "ReLU"
   bottom: "conv1_2_1"
   top: "conv1_2_1"
}

layer {
   name: "conv1_2_2"
   type: "Convolution"
   bottom: "conv1_2_1"
   top: "conv1_2_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 73
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_2_2"
   type: "BatchNorm"
   bottom: "conv1_2_2"
   top: "conv1_2_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2_2"
   type: "Scale"
   bottom: "conv1_2_2"
   top: "conv1_2_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_2_2"
   type: "ReLU"
   bottom: "conv1_2_2"
   top: "conv1_2_2"
}

layer {
   name: "conv1_2_3"
   type: "Convolution"
   bottom: "conv1_2_2"
   top: "conv1_2_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 292
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_2_3"
   type: "BatchNorm"
   bottom: "conv1_2_3"
   top: "conv1_2_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_2_3"
   type: "Scale"
   bottom: "conv1_2_3"
   top: "conv1_2_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv1_2"
   type: "Convolution"
   bottom: "res1_1"
   top: "zero_conv1_2"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 16
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero1_2"
   type: "Concat"
   bottom: "res1_1"
   bottom: "zero_conv1_2"
   top: "zero1_2"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res1_2"
   type: "Eltwise"
   bottom: "zero1_2"
   bottom: "conv1_2_3"
   top: "res1_2"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn1_3"
   type: "BatchNorm"
   bottom: "res1_2"
   top: "bn1_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3"
   type: "Scale"
   bottom: "bn1_3"
   top: "bn1_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv1_3_1"
   type: "Convolution"
   bottom: "bn1_3"
   top: "conv1_3_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 78
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_3_1"
   type: "BatchNorm"
   bottom: "conv1_3_1"
   top: "conv1_3_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3_1"
   type: "Scale"
   bottom: "conv1_3_1"
   top: "conv1_3_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_3_1"
   type: "ReLU"
   bottom: "conv1_3_1"
   top: "conv1_3_1"
}

layer {
   name: "conv1_3_2"
   type: "Convolution"
   bottom: "conv1_3_1"
   top: "conv1_3_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 78
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_3_2"
   type: "BatchNorm"
   bottom: "conv1_3_2"
   top: "conv1_3_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3_2"
   type: "Scale"
   bottom: "conv1_3_2"
   top: "conv1_3_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu1_3_2"
   type: "ReLU"
   bottom: "conv1_3_2"
   top: "conv1_3_2"
}

layer {
   name: "conv1_3_3"
   type: "Convolution"
   bottom: "conv1_3_2"
   top: "conv1_3_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 312
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn1_3_3"
   type: "BatchNorm"
   bottom: "conv1_3_3"
   top: "conv1_3_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale1_3_3"
   type: "Scale"
   bottom: "conv1_3_3"
   top: "conv1_3_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv1_3"
   type: "Convolution"
   bottom: "res1_2"
   top: "zero_conv1_3"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 20
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero1_3"
   type: "Concat"
   bottom: "res1_2"
   bottom: "zero_conv1_3"
   top: "zero1_3"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res1_3"
   type: "Eltwise"
   bottom: "zero1_3"
   bottom: "conv1_3_3"
   top: "res1_3"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_1"
   type: "BatchNorm"
   bottom: "res1_3"
   top: "bn2_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1"
   type: "Scale"
   bottom: "bn2_1"
   top: "bn2_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_1_1"
   type: "Convolution"
   bottom: "bn2_1"
   top: "conv2_1_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 82
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_1_1"
   type: "BatchNorm"
   bottom: "conv2_1_1"
   top: "conv2_1_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1_1"
   type: "Scale"
   bottom: "conv2_1_1"
   top: "conv2_1_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_1_1"
   type: "ReLU"
   bottom: "conv2_1_1"
   top: "conv2_1_1"
}

layer {
   name: "conv2_1_2"
   type: "Convolution"
   bottom: "conv2_1_1"
   top: "conv2_1_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 82
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 2
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_1_2"
   type: "BatchNorm"
   bottom: "conv2_1_2"
   top: "conv2_1_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1_2"
   type: "Scale"
   bottom: "conv2_1_2"
   top: "conv2_1_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_1_2"
   type: "ReLU"
   bottom: "conv2_1_2"
   top: "conv2_1_2"
}

layer {
   name: "conv2_1_3"
   type: "Convolution"
   bottom: "conv2_1_2"
   top: "conv2_1_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 328
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_1_3"
   type: "BatchNorm"
   bottom: "conv2_1_3"
   top: "conv2_1_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_1_3"
   type: "Scale"
   bottom: "conv2_1_3"
   top: "conv2_1_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "pool2"
   type: "Pooling"
   bottom: "res1_3"
   top: "pool2"
   pooling_param {
      pool: AVE
      kernel_size: 2
      stride: 2
   }}

layer {
   name: "zero_conv2_1"
   type: "Convolution"
   bottom: "pool2"
   top: "zero_conv2_1"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 16
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_1"
   type: "Concat"
   bottom: "pool2"
   bottom: "zero_conv2_1"
   top: "zero2_1"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_1"
   type: "Eltwise"
   bottom: "zero2_1"
   bottom: "conv2_1_3"
   top: "res2_1"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_2"
   type: "BatchNorm"
   bottom: "res2_1"
   top: "bn2_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2"
   type: "Scale"
   bottom: "bn2_2"
   top: "bn2_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_2_1"
   type: "Convolution"
   bottom: "bn2_2"
   top: "conv2_2_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 87
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_2_1"
   type: "BatchNorm"
   bottom: "conv2_2_1"
   top: "conv2_2_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2_1"
   type: "Scale"
   bottom: "conv2_2_1"
   top: "conv2_2_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_2_1"
   type: "ReLU"
   bottom: "conv2_2_1"
   top: "conv2_2_1"
}

layer {
   name: "conv2_2_2"
   type: "Convolution"
   bottom: "conv2_2_1"
   top: "conv2_2_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 87
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_2_2"
   type: "BatchNorm"
   bottom: "conv2_2_2"
   top: "conv2_2_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2_2"
   type: "Scale"
   bottom: "conv2_2_2"
   top: "conv2_2_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_2_2"
   type: "ReLU"
   bottom: "conv2_2_2"
   top: "conv2_2_2"
}

layer {
   name: "conv2_2_3"
   type: "Convolution"
   bottom: "conv2_2_2"
   top: "conv2_2_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 348
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_2_3"
   type: "BatchNorm"
   bottom: "conv2_2_3"
   top: "conv2_2_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_2_3"
   type: "Scale"
   bottom: "conv2_2_3"
   top: "conv2_2_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_2"
   type: "Convolution"
   bottom: "res2_1"
   top: "zero_conv2_2"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 20
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_2"
   type: "Concat"
   bottom: "res2_1"
   bottom: "zero_conv2_2"
   top: "zero2_2"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_2"
   type: "Eltwise"
   bottom: "zero2_2"
   bottom: "conv2_2_3"
   top: "res2_2"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_3"
   type: "BatchNorm"
   bottom: "res2_2"
   top: "bn2_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3"
   type: "Scale"
   bottom: "bn2_3"
   top: "bn2_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_3_1"
   type: "Convolution"
   bottom: "bn2_3"
   top: "conv2_3_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 91
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_3_1"
   type: "BatchNorm"
   bottom: "conv2_3_1"
   top: "conv2_3_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3_1"
   type: "Scale"
   bottom: "conv2_3_1"
   top: "conv2_3_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_3_1"
   type: "ReLU"
   bottom: "conv2_3_1"
   top: "conv2_3_1"
}

layer {
   name: "conv2_3_2"
   type: "Convolution"
   bottom: "conv2_3_1"
   top: "conv2_3_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 91
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_3_2"
   type: "BatchNorm"
   bottom: "conv2_3_2"
   top: "conv2_3_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3_2"
   type: "Scale"
   bottom: "conv2_3_2"
   top: "conv2_3_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_3_2"
   type: "ReLU"
   bottom: "conv2_3_2"
   top: "conv2_3_2"
}

layer {
   name: "conv2_3_3"
   type: "Convolution"
   bottom: "conv2_3_2"
   top: "conv2_3_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 364
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_3_3"
   type: "BatchNorm"
   bottom: "conv2_3_3"
   top: "conv2_3_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_3_3"
   type: "Scale"
   bottom: "conv2_3_3"
   top: "conv2_3_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_3"
   type: "Convolution"
   bottom: "res2_2"
   top: "zero_conv2_3"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 16
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_3"
   type: "Concat"
   bottom: "res2_2"
   bottom: "zero_conv2_3"
   top: "zero2_3"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_3"
   type: "Eltwise"
   bottom: "zero2_3"
   bottom: "conv2_3_3"
   top: "res2_3"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_4"
   type: "BatchNorm"
   bottom: "res2_3"
   top: "bn2_4"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4"
   type: "Scale"
   bottom: "bn2_4"
   top: "bn2_4"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_4_1"
   type: "Convolution"
   bottom: "bn2_4"
   top: "conv2_4_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 96
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_4_1"
   type: "BatchNorm"
   bottom: "conv2_4_1"
   top: "conv2_4_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4_1"
   type: "Scale"
   bottom: "conv2_4_1"
   top: "conv2_4_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_4_1"
   type: "ReLU"
   bottom: "conv2_4_1"
   top: "conv2_4_1"
}

layer {
   name: "conv2_4_2"
   type: "Convolution"
   bottom: "conv2_4_1"
   top: "conv2_4_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 96
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_4_2"
   type: "BatchNorm"
   bottom: "conv2_4_2"
   top: "conv2_4_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4_2"
   type: "Scale"
   bottom: "conv2_4_2"
   top: "conv2_4_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_4_2"
   type: "ReLU"
   bottom: "conv2_4_2"
   top: "conv2_4_2"
}

layer {
   name: "conv2_4_3"
   type: "Convolution"
   bottom: "conv2_4_2"
   top: "conv2_4_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 384
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_4_3"
   type: "BatchNorm"
   bottom: "conv2_4_3"
   top: "conv2_4_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_4_3"
   type: "Scale"
   bottom: "conv2_4_3"
   top: "conv2_4_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_4"
   type: "Convolution"
   bottom: "res2_3"
   top: "zero_conv2_4"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 20
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_4"
   type: "Concat"
   bottom: "res2_3"
   bottom: "zero_conv2_4"
   top: "zero2_4"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_4"
   type: "Eltwise"
   bottom: "zero2_4"
   bottom: "conv2_4_3"
   top: "res2_4"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_5"
   type: "BatchNorm"
   bottom: "res2_4"
   top: "bn2_5"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_5"
   type: "Scale"
   bottom: "bn2_5"
   top: "bn2_5"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_5_1"
   type: "Convolution"
   bottom: "bn2_5"
   top: "conv2_5_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 100
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_5_1"
   type: "BatchNorm"
   bottom: "conv2_5_1"
   top: "conv2_5_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_5_1"
   type: "Scale"
   bottom: "conv2_5_1"
   top: "conv2_5_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_5_1"
   type: "ReLU"
   bottom: "conv2_5_1"
   top: "conv2_5_1"
}

layer {
   name: "conv2_5_2"
   type: "Convolution"
   bottom: "conv2_5_1"
   top: "conv2_5_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 100
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_5_2"
   type: "BatchNorm"
   bottom: "conv2_5_2"
   top: "conv2_5_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_5_2"
   type: "Scale"
   bottom: "conv2_5_2"
   top: "conv2_5_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_5_2"
   type: "ReLU"
   bottom: "conv2_5_2"
   top: "conv2_5_2"
}

layer {
   name: "conv2_5_3"
   type: "Convolution"
   bottom: "conv2_5_2"
   top: "conv2_5_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 400
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_5_3"
   type: "BatchNorm"
   bottom: "conv2_5_3"
   top: "conv2_5_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_5_3"
   type: "Scale"
   bottom: "conv2_5_3"
   top: "conv2_5_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_5"
   type: "Convolution"
   bottom: "res2_4"
   top: "zero_conv2_5"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 16
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_5"
   type: "Concat"
   bottom: "res2_4"
   bottom: "zero_conv2_5"
   top: "zero2_5"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_5"
   type: "Eltwise"
   bottom: "zero2_5"
   bottom: "conv2_5_3"
   top: "res2_5"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_6"
   type: "BatchNorm"
   bottom: "res2_5"
   top: "bn2_6"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_6"
   type: "Scale"
   bottom: "bn2_6"
   top: "bn2_6"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_6_1"
   type: "Convolution"
   bottom: "bn2_6"
   top: "conv2_6_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 105
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_6_1"
   type: "BatchNorm"
   bottom: "conv2_6_1"
   top: "conv2_6_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_6_1"
   type: "Scale"
   bottom: "conv2_6_1"
   top: "conv2_6_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_6_1"
   type: "ReLU"
   bottom: "conv2_6_1"
   top: "conv2_6_1"
}

layer {
   name: "conv2_6_2"
   type: "Convolution"
   bottom: "conv2_6_1"
   top: "conv2_6_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 105
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_6_2"
   type: "BatchNorm"
   bottom: "conv2_6_2"
   top: "conv2_6_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_6_2"
   type: "Scale"
   bottom: "conv2_6_2"
   top: "conv2_6_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_6_2"
   type: "ReLU"
   bottom: "conv2_6_2"
   top: "conv2_6_2"
}

layer {
   name: "conv2_6_3"
   type: "Convolution"
   bottom: "conv2_6_2"
   top: "conv2_6_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 420
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_6_3"
   type: "BatchNorm"
   bottom: "conv2_6_3"
   top: "conv2_6_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_6_3"
   type: "Scale"
   bottom: "conv2_6_3"
   top: "conv2_6_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_6"
   type: "Convolution"
   bottom: "res2_5"
   top: "zero_conv2_6"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 20
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_6"
   type: "Concat"
   bottom: "res2_5"
   bottom: "zero_conv2_6"
   top: "zero2_6"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_6"
   type: "Eltwise"
   bottom: "zero2_6"
   bottom: "conv2_6_3"
   top: "res2_6"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_7"
   type: "BatchNorm"
   bottom: "res2_6"
   top: "bn2_7"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_7"
   type: "Scale"
   bottom: "bn2_7"
   top: "bn2_7"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_7_1"
   type: "Convolution"
   bottom: "bn2_7"
   top: "conv2_7_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 109
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_7_1"
   type: "BatchNorm"
   bottom: "conv2_7_1"
   top: "conv2_7_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_7_1"
   type: "Scale"
   bottom: "conv2_7_1"
   top: "conv2_7_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_7_1"
   type: "ReLU"
   bottom: "conv2_7_1"
   top: "conv2_7_1"
}

layer {
   name: "conv2_7_2"
   type: "Convolution"
   bottom: "conv2_7_1"
   top: "conv2_7_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 109
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_7_2"
   type: "BatchNorm"
   bottom: "conv2_7_2"
   top: "conv2_7_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_7_2"
   type: "Scale"
   bottom: "conv2_7_2"
   top: "conv2_7_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_7_2"
   type: "ReLU"
   bottom: "conv2_7_2"
   top: "conv2_7_2"
}

layer {
   name: "conv2_7_3"
   type: "Convolution"
   bottom: "conv2_7_2"
   top: "conv2_7_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 436
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_7_3"
   type: "BatchNorm"
   bottom: "conv2_7_3"
   top: "conv2_7_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_7_3"
   type: "Scale"
   bottom: "conv2_7_3"
   top: "conv2_7_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_7"
   type: "Convolution"
   bottom: "res2_6"
   top: "zero_conv2_7"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 16
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_7"
   type: "Concat"
   bottom: "res2_6"
   bottom: "zero_conv2_7"
   top: "zero2_7"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_7"
   type: "Eltwise"
   bottom: "zero2_7"
   bottom: "conv2_7_3"
   top: "res2_7"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_8"
   type: "BatchNorm"
   bottom: "res2_7"
   top: "bn2_8"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_8"
   type: "Scale"
   bottom: "bn2_8"
   top: "bn2_8"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_8_1"
   type: "Convolution"
   bottom: "bn2_8"
   top: "conv2_8_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 114
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_8_1"
   type: "BatchNorm"
   bottom: "conv2_8_1"
   top: "conv2_8_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_8_1"
   type: "Scale"
   bottom: "conv2_8_1"
   top: "conv2_8_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_8_1"
   type: "ReLU"
   bottom: "conv2_8_1"
   top: "conv2_8_1"
}

layer {
   name: "conv2_8_2"
   type: "Convolution"
   bottom: "conv2_8_1"
   top: "conv2_8_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 114
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_8_2"
   type: "BatchNorm"
   bottom: "conv2_8_2"
   top: "conv2_8_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_8_2"
   type: "Scale"
   bottom: "conv2_8_2"
   top: "conv2_8_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_8_2"
   type: "ReLU"
   bottom: "conv2_8_2"
   top: "conv2_8_2"
}

layer {
   name: "conv2_8_3"
   type: "Convolution"
   bottom: "conv2_8_2"
   top: "conv2_8_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 456
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_8_3"
   type: "BatchNorm"
   bottom: "conv2_8_3"
   top: "conv2_8_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_8_3"
   type: "Scale"
   bottom: "conv2_8_3"
   top: "conv2_8_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_8"
   type: "Convolution"
   bottom: "res2_7"
   top: "zero_conv2_8"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 20
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_8"
   type: "Concat"
   bottom: "res2_7"
   bottom: "zero_conv2_8"
   top: "zero2_8"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_8"
   type: "Eltwise"
   bottom: "zero2_8"
   bottom: "conv2_8_3"
   top: "res2_8"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_9"
   type: "BatchNorm"
   bottom: "res2_8"
   top: "bn2_9"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_9"
   type: "Scale"
   bottom: "bn2_9"
   top: "bn2_9"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_9_1"
   type: "Convolution"
   bottom: "bn2_9"
   top: "conv2_9_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 119
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_9_1"
   type: "BatchNorm"
   bottom: "conv2_9_1"
   top: "conv2_9_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_9_1"
   type: "Scale"
   bottom: "conv2_9_1"
   top: "conv2_9_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_9_1"
   type: "ReLU"
   bottom: "conv2_9_1"
   top: "conv2_9_1"
}

layer {
   name: "conv2_9_2"
   type: "Convolution"
   bottom: "conv2_9_1"
   top: "conv2_9_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 119
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_9_2"
   type: "BatchNorm"
   bottom: "conv2_9_2"
   top: "conv2_9_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_9_2"
   type: "Scale"
   bottom: "conv2_9_2"
   top: "conv2_9_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_9_2"
   type: "ReLU"
   bottom: "conv2_9_2"
   top: "conv2_9_2"
}

layer {
   name: "conv2_9_3"
   type: "Convolution"
   bottom: "conv2_9_2"
   top: "conv2_9_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 476
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_9_3"
   type: "BatchNorm"
   bottom: "conv2_9_3"
   top: "conv2_9_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_9_3"
   type: "Scale"
   bottom: "conv2_9_3"
   top: "conv2_9_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_9"
   type: "Convolution"
   bottom: "res2_8"
   top: "zero_conv2_9"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 20
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_9"
   type: "Concat"
   bottom: "res2_8"
   bottom: "zero_conv2_9"
   top: "zero2_9"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_9"
   type: "Eltwise"
   bottom: "zero2_9"
   bottom: "conv2_9_3"
   top: "res2_9"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_10"
   type: "BatchNorm"
   bottom: "res2_9"
   top: "bn2_10"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_10"
   type: "Scale"
   bottom: "bn2_10"
   top: "bn2_10"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_10_1"
   type: "Convolution"
   bottom: "bn2_10"
   top: "conv2_10_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 123
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_10_1"
   type: "BatchNorm"
   bottom: "conv2_10_1"
   top: "conv2_10_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_10_1"
   type: "Scale"
   bottom: "conv2_10_1"
   top: "conv2_10_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_10_1"
   type: "ReLU"
   bottom: "conv2_10_1"
   top: "conv2_10_1"
}

layer {
   name: "conv2_10_2"
   type: "Convolution"
   bottom: "conv2_10_1"
   top: "conv2_10_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 123
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_10_2"
   type: "BatchNorm"
   bottom: "conv2_10_2"
   top: "conv2_10_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_10_2"
   type: "Scale"
   bottom: "conv2_10_2"
   top: "conv2_10_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_10_2"
   type: "ReLU"
   bottom: "conv2_10_2"
   top: "conv2_10_2"
}

layer {
   name: "conv2_10_3"
   type: "Convolution"
   bottom: "conv2_10_2"
   top: "conv2_10_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 492
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_10_3"
   type: "BatchNorm"
   bottom: "conv2_10_3"
   top: "conv2_10_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_10_3"
   type: "Scale"
   bottom: "conv2_10_3"
   top: "conv2_10_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_10"
   type: "Convolution"
   bottom: "res2_9"
   top: "zero_conv2_10"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 16
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_10"
   type: "Concat"
   bottom: "res2_9"
   bottom: "zero_conv2_10"
   top: "zero2_10"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_10"
   type: "Eltwise"
   bottom: "zero2_10"
   bottom: "conv2_10_3"
   top: "res2_10"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_11"
   type: "BatchNorm"
   bottom: "res2_10"
   top: "bn2_11"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_11"
   type: "Scale"
   bottom: "bn2_11"
   top: "bn2_11"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_11_1"
   type: "Convolution"
   bottom: "bn2_11"
   top: "conv2_11_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 128
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_11_1"
   type: "BatchNorm"
   bottom: "conv2_11_1"
   top: "conv2_11_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_11_1"
   type: "Scale"
   bottom: "conv2_11_1"
   top: "conv2_11_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_11_1"
   type: "ReLU"
   bottom: "conv2_11_1"
   top: "conv2_11_1"
}

layer {
   name: "conv2_11_2"
   type: "Convolution"
   bottom: "conv2_11_1"
   top: "conv2_11_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 128
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_11_2"
   type: "BatchNorm"
   bottom: "conv2_11_2"
   top: "conv2_11_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_11_2"
   type: "Scale"
   bottom: "conv2_11_2"
   top: "conv2_11_2"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_11_2"
   type: "ReLU"
   bottom: "conv2_11_2"
   top: "conv2_11_2"
}

layer {
   name: "conv2_11_3"
   type: "Convolution"
   bottom: "conv2_11_2"
   top: "conv2_11_3"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 512
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_11_3"
   type: "BatchNorm"
   bottom: "conv2_11_3"
   top: "conv2_11_3"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_11_3"
   type: "Scale"
   bottom: "conv2_11_3"
   top: "conv2_11_3"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "zero_conv2_11"
   type: "Convolution"
   bottom: "res2_10"
   top: "zero_conv2_11"
   param {
      lr_mult: 0
      decay_mult: 0
   }
   convolution_param {
      num_output: 20
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "constant"
         value: 0.0
      }
   }
}

layer {
   name: "zero2_11"
   type: "Concat"
   bottom: "res2_10"
   bottom: "zero_conv2_11"
   top: "zero2_11"
   concat_param {
      axis: 1
   }
}

layer {
   name: "res2_11"
   type: "Eltwise"
   bottom: "zero2_11"
   bottom: "conv2_11_3"
   top: "res2_11"
   eltwise_param {
      operation: SUM 
   }
}

layer {
   name: "bn2_12"
   type: "BatchNorm"
   bottom: "res2_11"
   top: "bn2_12"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_12"
   type: "Scale"
   bottom: "bn2_12"
   top: "bn2_12"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "conv2_12_1"
   type: "Convolution"
   bottom: "bn2_12"
   top: "conv2_12_1"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 132
      bias_term: false
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_12_1"
   type: "BatchNorm"
   bottom: "conv2_12_1"
   top: "conv2_12_1"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
      use_global_stats: true
   }
}

layer {
   name: "scale2_12_1"
   type: "Scale"
   bottom: "conv2_12_1"
   top: "conv2_12_1"
   scale_param {
      bias_term: true
   }
}

layer {
   name: "relu2_12_1"
   type: "ReLU"
   bottom: "conv2_12_1"
   top: "conv2_12_1"
}

layer {
   name: "conv2_12_2"
   type: "Convolution"
   bottom: "conv2_12_1"
   top: "conv2_12_2"
   param {
      lr_mult: 1
      decay_mult: 1
   }
   convolution_param {
      num_output: 132
      bias_term: false
      pad: 1
      kernel_size: 3
      stride: 1
      weight_filler {
         type: "msra"
      }
   }
}

layer {
   name: "bn2_12_2"
   type: "BatchNorm"
   bottom: "conv2_12_2"
   top: "conv2_12_2"
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   param {
      lr_mult: 0
   }
   batch_norm_param {
